app/controllers/admin/categories_controller.rb

  def index

     params[:search] ||= {}
     params[:search][:conditions] ||= {}
     params[:search][:conditions][:id] = params[:id] unless params[:id].blank?
     @search = Category.new_search(params[:search])
     @categories = @search.all
     @parent = Category.find_all_by_parent_id(nil)
---
SELECT * FROM `categories` WHERE (`categories`.parent_id = 1) ORDER BY name
SELECT * FROM `categories` WHERE (`categories`.`parent_id` IS NULL)

 def subcategory_new
  @category = Category.new
  @parent = Category.find_all_by_parent_id(nil)
---
SELECT * FROM `categories` WHERE (`categories`.parent_id = 1) ORDER BY name