app/controllers/categories_controller.rb

SELECT * FROM `categories` WHERE (`categories`.parent_id = 1) ORDER BY name
SELECT * FROM `categories` WHERE (`categories`.`parent_id` IS NULL)
---
  def index

     params[:search] ||= {}
     params[:search][:conditions] ||= {}
     params[:search][:conditions][:id] = params[:id] unless params[:id].blank?
     @search = Category.new_search(params[:search])
     @categories = @search.all
     @parent = Category.find_all_by_parent_id(nil)

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
UPDATE `categories` SET `updated_at` = '2010-02-19 06:21:54', `avatar_file_size` = 24411, `avatar_file_name` = 'Chanel_Bags_Replica_flap_bag_purple.jpg', `avatar_updated_at` = '2010-02-19 06:21:54' WHERE `id` = 1
---
  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])