app/controllers/user_sessions_controller.rb

INSERT INTO `users` (`anniversary_date`, `special_date`, `address`, `city`, `name`, `facebook_id`, `created_at`, `zip`, `last_request_at`, `crypted_password`, `session_key`, `updated_at`, `username`, `gender`, `current_login_ip`, `password_salt`, `current_login_at`, `last_name`, `persistence_token`, `login_count`, `date_of_birth`, `religion`, `last_login_ip`, `marital_status`, `login`, `last_login_at`, `first_name`, `state`, `email`) VALUES(NULL, NULL, NULL, NULL, 'Seetha Rathna', 100000402570887, '2010-02-18 09:51:21', NULL, NULL, NULL, '3.IVrwRMKowccCSBLZNM5oyQ__.3600.1266490800-100000402570887', '2010-02-18 09:51:21', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
---
  def create

    @user_session = UserSession.new(params[:user_session])


    if @user_session.save