app/controllers/wish_lists_controller.rb

  def index
    @wish_lists = WishList.all
    @wish_list = WishList.find(:first,:conditions => ["facebook_id =?",facebook_session.user.to_i])
---
SELECT * FROM `wish_lists` WHERE (facebook_id =100000402570887) LIMIT 1
SELECT * FROM `wish_lists` WHERE (`wish_lists`.`facebook_id` = 1143568171) LIMIT 1
SELECT facebook_id, session_key FROM `users` WHERE (facebook_id != '')

  def show

    @wish_list = WishList.find(params[:id]) rescue nil
   if @wish_list
    @owner = facebook_session.user
    @facebook_id = @wish_list.facebook_id
    @owner_wish_list = WishList.find(:first,:conditions => ["facebook_id =?",facebook_session.user.to_i]) rescue ""
    @categories = @wish_list.categories
    @items = @wish_list.categories.map{|c| c.category_id}
---
SELECT * FROM `wish_lists` WHERE (facebook_id =100000402570887) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
SELECT * FROM `categories` INNER JOIN `categories_wish_lists` ON `categories`.id = `categories_wish_lists`.category_id WHERE (`categories_wish_lists`.wish_list_id = 79 )

  def edit
    @wish_list = WishList.find(params[:id])
---
SELECT * FROM `wish_lists` WHERE (`wish_lists`.`id` = 79)

  def create
    @user = facebook_session.user
    @wish_list = WishList.new(params[:wish_list])
    @wish_list.facebook_id = facebook_session.user.to_i
    if @wish_list.save
---
INSERT INTO `wish_lists` (`facebook_id`, `name`, `created_at`, `updated_at`, `category_id`, `description`) VALUES(100000713724156, 'My new wishlist', '2010-02-19 05:54:33', '2010-02-19 05:54:33', NULL, 'My new wishlist')